Exam/app/Controllers/PrefixeController.php

    public function index()
    {
        $data = [
            'prefixes' => $this->prefixeModel->findAll(),
            'title' => 'Configuration des Préfixes',
        ];
---
SELECT *
FROM `prefixes`