Exam/app/Models/FraisBaremeModel.php

SELECT *
FROM `frais_baremes`
WHERE `type_operation` = 'transfert'
AND `montant_min` <= 10000
AND `montant_max` >= 10000
 LIMIT 1
---
    public function getFrais(string $typeOperation, float $montant): float
    {
        try {
            log_message('debug', 'Recherche frais pour ' . $typeOperation . ' - ' . $montant);

            $rule = $this->where('type_operation', $typeOperation)
                         ->where('montant_min <=', $montant)
                         ->where('montant_max >=', $montant)
                         ->first();