Exam/app/Models/GainsModel.php

SELECT `type_operation`, COUNT(*) as nombre, SUM(frais_appliques) as total_frais
FROM `transactions`
WHERE `commission_inter_operateur` = 0
GROUP BY `type_operation`
---
    public function getGainsParOperateur()
    {
        // Retourner des données par défaut si la table n'existe pas
        if (!$this->db->tableExists('transactions')) {
            return ['meme_operateur' => [], 'autre_operateur' => []];
        }

        try {
            // Gains pour le même opérateur (commission_inter_operateur = 0)
            $memeOperateur = $this->db->table('transactions')
                ->select('type_operation, COUNT(*) as nombre, SUM(frais_appliques) as total_frais')
                ->where('commission_inter_operateur', 0)
                ->groupBy('type_operation')
                ->get()
                ->getResultArray();

SELECT `type_operation`, COUNT(*) as nombre, SUM(montant) as total_montant, SUM(frais_appliques) as total_frais
FROM `transactions`
GROUP BY `type_operation`
---
    public function getGainsParType()
    {
        if (!$this->db->tableExists('transactions')) {
            return [];
        }

        try {
            return $this->db->table('transactions')
                ->select('type_operation, COUNT(*) as nombre, SUM(montant) as total_montant, SUM(frais_appliques) as total_frais')
                ->groupBy('type_operation')
                ->get()
                ->getResultArray() ?: [];

SELECT `transactions`.*
FROM `transactions`
ORDER BY `transactions`.`created_at` DESC
 LIMIT 50
---
    public function getTransactions($limit = 50)
    {
        if (!$this->db->tableExists('transactions')) {
            return [];
        }

        try {
            return $this->db->table('transactions')
                ->select('transactions.*')
                ->orderBy('transactions.created_at', 'DESC')
                ->limit($limit)
                ->get()
                ->getResultArray() ?: [];

SELECT SUM(frais_appliques) as total
FROM `transactions`
WHERE `type_operation` IN ('retrait','transfert')
---
    public function getTotalGains()
    {
        if (!$this->db->tableExists('transactions')) {
            return 0;
        }

        try {
            $result = $this->db->table('transactions')
                ->select('SUM(frais_appliques) as total')
                ->whereIn('type_operation', ['retrait', 'transfert'])
                ->get()
                ->getRowArray();