Exam/app/Models/TransactionModel.php

                return false;
            }

            $result = $this->insert($data);
---
INSERT INTO `transactions` (`client_id`, `type_operation`, `montant`, `frais_appliques`, `commission`, `montant_net`, `solde_apres`, `include_fees`, `is_multiple`, `destinations`, `description`, `reference`, `status`, `operateur_id`) VALUES ('CLT0002', 'transfert', 10000, 0, 0, -10000, 63000, 1, 1, '["340000001","340000003"]', 'Envoi multiple vers 2 numéros', 'TXN20260720611851', 'completed', NULL)

    public function getTransactionsClient(string $clientId, int $limit = 50): array
    {
        try {
            return $this->where('client_id', $clientId)
                        ->orderBy('created_at', 'DESC')
                        ->findAll($limit);
---
SELECT *
FROM `transactions`
WHERE `client_id` = 'CLT0001'
ORDER BY `created_at` DESC
 LIMIT 50