Exam/app/Models/UserModel.php

    public function findUser($username, $phoneNumber)
    {
        try {
            return $this->where('username', $username)
                        ->where('phone_number', $phoneNumber)
                        ->first();
---
SELECT *
FROM `users`
WHERE `username` = 'Pierre Ravel'
AND `phone_number` = '340000001'
 LIMIT 1

    public function createUser($username, $phoneNumber)
    {
        try {
            $data = [
                'username' => $username,
                'phone_number' => $phoneNumber,
                'login_count' => 1,
                'last_login' => date('Y-m-d H:i:s')
            ];

            $this->insert($data);
            return $this->where('phone_number', $phoneNumber)->first();
---
INSERT INTO `users` (`username`, `phone_number`, `login_count`, `last_login`, `created_at`, `updated_at`) VALUES ('Pierre Ravel', '340000001', 1, '2026-07-20 07:31:38', '2026-07-20 07:31:38', '2026-07-20 07:31:38')
SELECT *
FROM `users`
WHERE `phone_number` = '340000001'
 LIMIT 1