Exam/app/Controllers/Client/Operations.php

INSERT INTO `transactions` (`client_id`, `type_operation`, `montant`, `frais_appliques`, `montant_net`, `solde_apres`, `description`, `reference`, `created_at`, `updated_at`) VALUES ('CLT0002', 'retrait', 1000, 0, -1000, 74900, 'Retrait automatique', 'TXN20260720504224', '2026-07-20 11:18:54', '2026-07-20 11:18:54')
---
                'reference' => 'TXN' . date('Ymd') . rand(100000, 999999)
            ];

            $this->transactionModel->insert($transactionData);